import java.util.Scanner;
/*
hw7_12_12_22
    HW
    1)Создать Scanner и организовать ввод чисел

    2) Проверить больше ли некоторого значения
    сумма двух чисел, если нет вывести сообщение
    что сумма меньше заданного значение

    3) Через case обработать несколько вариантов
    введенной переменной, предусмотреть дефолтный случай
    4) Инициализировать массив псевдослучайными числами(Random)
    5) Найти сумму и произведение всех элементов этого массива
    6) Сделать класс, который будет искать площадь треугольника,
    прямоугольника и окружности
 */
public class Main {
    static Scanner scanner = new Scanner(System.in);                                    //1)Создать Scanner и организовать ввод чисел

    public static void main(String[] args) {
    Hw7 hw7 = new Hw7();
    }
}